{
    "Dublin Bay South": [
        {
            "photo": "https://img2.thejournal.ie/article/5630811/river?version=5630868&width=1318",
            "headline": "BAI rejects Fine Gael complaint about Bacik appearing on RTÉ lifestyle show before by-election",
            "summary": "The Broadcasting Authority of Ireland (BAI) dismissed a complaint from Fine Gael's general secretary, John Carroll, regarding Labour’s Ivana Bacik's appearance on RTÉ's 'National Treasures' before the Dublin Bay South by-election. Carroll argued that Bacik's feature in the lifestyle program, where she was unchallenged and could be presented positively, was unfair. He was unsatisfied with RTÉ's proposed remedy of an extended report on Prime Time. RTÉ admitted airing the episode was an inadvertent error and took steps to limit its availability. They also aired an extended constituency report on the by-election. However, the BAI rejected the complaint, noting that Bacik’s political life and the by-election were not mentioned in the program and that RTÉ ensured fairness in overall election coverage. Additionally, the BAI rejected 12 other complaints on various grounds, including claims of bias and stereotyping in different radio shows.",
            "link": "https://www.thejournal.ie/bai-complaint-dub-bay-south-by-election-5630811-Dec2021/",
            "source": "thejournal.ie"
        },
        {
            "photo": "https://i.imgur.com/Ot08ZXh.png",
            "headline": "James Geoghegan has a lot to offer both Dublin Bay South and the country. He would make a wonderful TD! This Thursday, please vote No",
            "summary": "James Geoghegan has a lot to offer both Dublin Bay South and the country. He would make a wonderful TD! This Thursday, please vote No. 1 James Geoghegan. ",
            "link": "https://www.facebook.com/watch/?v=226941669277550",
            "source": "facebook.com"
        },
        {
            "photo": "https://www.irishtimes.com/resizer/PidfZlz5XjVMCyOkLyNF67GMojw=/400x225/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/6B3LC2GMHFKNNOONFY4EU56Y2M.jpg",
            "headline": "'Go-away money': When property developers and objectors do deals",
            "summary": "Views differ on the ethics of locals seeking or being offered payments from builders to avoid costly litigation",
            "link": "https://www.irishtimes.com/ireland/2023/06/17/go-away-money-the-dispute-ending-deals-between-property-developers-and-objectors/",
            "source": "irishtmes.com"
        }
    ]
}